## Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd

m = np.random.randint(30, size=(10,3))

df = pd.DataFrame(m, columns =["var1","var2","var3"])
df

   var1  var2  var3
0     6    13     0
1     8    17    21
2    12    12    26
3    25    13     6
4    21    25     0
5    17    18    17
6     7    17    28
7    20    12    18
8    19    29    18
9     0    24    25

In [3]:
df["var1"]

0     6
1     8
2    12
3    25
4    21
5    17
6     7
7    20
8    19
9     0
Name: var1, dtype: int32

In [4]:
df["var1"][0:2]

0    6
1    8
Name: var1, dtype: int32

In [7]:
df[0:2][["var1","var2"]]

   var1  var2
0     6    13
1     8    17

In [8]:
df

   var1  var2  var3
0     6    13     0
1     8    17    21
2    12    12    26
3    25    13     6
4    21    25     0
5    17    18    17
6     7    17    28
7    20    12    18
8    19    29    18
9     0    24    25

In [10]:
df[df.var1>15]

   var1  var2  var3
3    25    13     6
4    21    25     0
5    17    18    17
7    20    12    18
8    19    29    18

In [11]:
df[df.var1>15]["var1"]

3    25
4    21
5    17
7    20
8    19
Name: var1, dtype: int32

In [12]:
df[df.var1>15]["var2"]

3    13
4    25
5    18
7    12
8    29
Name: var2, dtype: int32

In [13]:
df[(df.var1>15) & (df.var3<5)]

   var1  var2  var3
4    21    25     0

In [15]:
df.loc[(df.var1>15) ,["var1","var2"]]

   var1  var2
3    25    13
4    21    25
5    17    18
7    20    12
8    19    29